[Killed] EqualityOperator
MT-2/src/converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "ounces")
+    if(measurement != "ounces")
     {
         result1 = (val/16).toFixed(2) + " pounds";
killedBy: WeightConverter should convert ounces to pounds and tons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.25 pounds"
Received: "w"

[Killed] StringLiteral
MT-2/src/converter.js:7:41
 
     if(measurement == "ounces")
     {
-        result1 = (val/16).toFixed(2) + " pounds";
+        result1 = (val/16).toFixed(2) + "";
         result2 = (val/32000).toFixed(2) + " tons";
     } else if(measurement === "pounds") {
killedBy: WeightConverter should convert ounces to pounds and tons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.25 pounds"
Received: "0.25"

[Killed] StringLiteral
MT-2/src/converter.js:11:43
         result2 = (val/32000).toFixed(2) + " tons";
     } else if(measurement === "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
-        result2 = (val/2000).toFixed(2) + " tons";
+        result2 = (val/2000).toFixed(2) + "";
     } else if(measurement === "tons") {
         result1 = (val*2000).toFixed(2) + " pounds";
killedBy: WeightConverter should convert pounds to ounces and tons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.00 tons"
Received: "0.00"
