[Killed] BooleanLiteral
MT-2/src/isPalindrome.js:9:37
         reversed = reversed*10 + reminder;
         number = parseInt(number / 10);
     }
-    if(original == reversed) return true;
+    if(original == reversed) return false;
     return false;
 }
killedBy: isPalindrome should return true for a palindrome number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
MT-2/src/isPalindrome.js:9:8
         reversed = reversed*10 + reminder;
         number = parseInt(number / 10);
     }
-    if(original == reversed) return true;
+    if(true) return true;
     return false;
 }
killedBy: isPalindrome should return false for a non-palindrome number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
