[Timeout] BlockStatement
MT-2/src/mergeSort.js:3:41
 function merge(left, right) {
     let sortedArr = [] 
-    while (left.length && right.length) {
-      if (left[0] < right[0]) {
-        sortedArr.push(left.shift())
-      } else {
-        sortedArr.push(right.shift())
-      }
-    }
+    while (left.length && right.length) {}
     return [...sortedArr, ...left, ...right]
 }

[Timeout] EqualityOperator
MT-2/src/mergeSort.js:13:9
     return [...sortedArr, ...left, ...right]
 }
 function mergeSort(arr) {
-    if (arr.length <= 1) return arr
+    if (arr.length < 1) return arr
     let mid = Math.floor(arr.length / 2)
     let left = mergeSort(arr.slice(0, mid))

[Killed] ObjectLiteral
MT-2/src/mergeSort.js:20:18
     return merge(left, right)
 }
 // console.log(mergeSort([3, 5, 8, 5, 99, 1]))
-module.exports = {
-    mergeSort
-}
+module.exports = {}
 
killedBy: mergeSort should correctly sort an array in ascending order for negative numbers
statusReason: TypeError: mergeSort is not a function
